{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      ",": 0,
      "0": 1,
      "1": 2,
      "2": 3,
      "00": 4,
      "01": 5,
      "02": 6,
      "11": 7,
      "22": 8,
      "12": 9,
      "100": 10,
      "002": 11,
      "101": 12,
      "102": 13,
      "0000": 14,
      "012": 15,
      "022": 16,
      "122": 17,
      "112": 18,
      "0001": 19,
      "0002": 20,
      "10": 21,
      "222": 22,
      "0100": 23,
      "1002": 24,
      "0200": 25,
      "0101": 26,
      "0011": 27,
      "0102": 28,
      "0012": 29,
      "0022": 30,
      "0202": 31,
      "000": 32,
      "1111": 33,
      "1022": 34,
      "1012": 35,
      "0111": 36,
      "00100": 37,
      "0112": 38,
      "0122": 39,
      "0222": 40,
      "010": 41,
      "00002": 42,
      "0211": 43,
      "0212": 44,
      "1222": 45,
      "001": 46,
      "020": 47,
      "0201": 48,
      "1211": 49,
      "01100": 50,
      "02100": 51,
      "00102": 52,
      "01002": 53,
      "00101": 54,
      "2222": 55,
      "00012": 56,
      "211": 57,
      "011": 58,
      "00022": 59,
      "02002": 60,
      "120": 61,
      "021": 62,
      "212": 63,
      "1112": 64,
      "1122": 65,
      "2100": 66,
      "020000": 67,
      "010000": 68,
      "110": 69,
      "1212": 70,
      "02101": 71,
      "01101": 72,
      "2002": 73,
      "01102": 74,
      "01012": 75,
      "00112": 76,
      "00122": 77,
      "202": 78,
      "11100": 79,
      "10022": 80,
      "01022": 81,
      "0020": 82,
      "02102": 83,
      "0010": 84,
      "1000": 85,
      "02012": 86,
      "111": 87,
      "00222": 88,
      "02022": 89,
      "20000": 90,
      "12100": 91,
      "11002": 92,
      "11101": 93,
      "121": 94,
      "2101": 95,
      "12002": 96,
      "20": 97,
      "010002": 98,
      "1202": 99
    },
    "merges": [
      [
        "0",
        "0"
      ],
      [
        "0",
        "1"
      ],
      [
        "0",
        "2"
      ],
      [
        "1",
        "1"
      ],
      [
        "2",
        "2"
      ],
      [
        "1",
        "2"
      ],
      [
        "1",
        "00"
      ],
      [
        "00",
        "2"
      ],
      [
        "1",
        "01"
      ],
      [
        "1",
        "02"
      ],
      [
        "00",
        "00"
      ],
      [
        "01",
        "2"
      ],
      [
        "02",
        "2"
      ],
      [
        "1",
        "22"
      ],
      [
        "11",
        "2"
      ],
      [
        "00",
        "01"
      ],
      [
        "00",
        "02"
      ],
      [
        "1",
        "0"
      ],
      [
        "22",
        "2"
      ],
      [
        "01",
        "00"
      ],
      [
        "100",
        "2"
      ],
      [
        "02",
        "00"
      ],
      [
        "01",
        "01"
      ],
      [
        "00",
        "11"
      ],
      [
        "01",
        "02"
      ],
      [
        "00",
        "12"
      ],
      [
        "00",
        "22"
      ],
      [
        "02",
        "02"
      ],
      [
        "00",
        "0"
      ],
      [
        "11",
        "11"
      ],
      [
        "102",
        "2"
      ],
      [
        "101",
        "2"
      ],
      [
        "01",
        "11"
      ],
      [
        "00",
        "100"
      ],
      [
        "01",
        "12"
      ],
      [
        "01",
        "22"
      ],
      [
        "02",
        "22"
      ],
      [
        "01",
        "0"
      ],
      [
        "00",
        "002"
      ],
      [
        "02",
        "11"
      ],
      [
        "02",
        "12"
      ],
      [
        "122",
        "2"
      ],
      [
        "00",
        "1"
      ],
      [
        "02",
        "0"
      ],
      [
        "02",
        "01"
      ],
      [
        "12",
        "11"
      ],
      [
        "01",
        "100"
      ],
      [
        "02",
        "100"
      ],
      [
        "00",
        "102"
      ],
      [
        "01",
        "002"
      ],
      [
        "00",
        "101"
      ],
      [
        "22",
        "22"
      ],
      [
        "00",
        "012"
      ],
      [
        "2",
        "11"
      ],
      [
        "01",
        "1"
      ],
      [
        "00",
        "022"
      ],
      [
        "02",
        "002"
      ],
      [
        "12",
        "0"
      ],
      [
        "02",
        "1"
      ],
      [
        "2",
        "12"
      ],
      [
        "11",
        "12"
      ],
      [
        "11",
        "22"
      ],
      [
        "2",
        "100"
      ],
      [
        "02",
        "0000"
      ],
      [
        "01",
        "0000"
      ],
      [
        "11",
        "0"
      ],
      [
        "12",
        "12"
      ],
      [
        "02",
        "101"
      ],
      [
        "01",
        "101"
      ],
      [
        "2",
        "002"
      ],
      [
        "01",
        "102"
      ],
      [
        "01",
        "012"
      ],
      [
        "00",
        "112"
      ],
      [
        "00",
        "122"
      ],
      [
        "2",
        "02"
      ],
      [
        "11",
        "100"
      ],
      [
        "100",
        "22"
      ],
      [
        "01",
        "022"
      ],
      [
        "002",
        "0"
      ],
      [
        "02",
        "102"
      ],
      [
        "00",
        "10"
      ],
      [
        "100",
        "0"
      ],
      [
        "02",
        "012"
      ],
      [
        "11",
        "1"
      ],
      [
        "00",
        "222"
      ],
      [
        "02",
        "022"
      ],
      [
        "2",
        "0000"
      ],
      [
        "12",
        "100"
      ],
      [
        "11",
        "002"
      ],
      [
        "11",
        "101"
      ],
      [
        "12",
        "1"
      ],
      [
        "2",
        "101"
      ],
      [
        "12",
        "002"
      ],
      [
        "2",
        "0"
      ],
      [
        "01",
        "0002"
      ],
      [
        "12",
        "02"
      ]
    ]
  }
}